---
kind: method
id: M:Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Dispose
source: html/1e3565ce-b0e4-0571-38c7-c55a004b85b0.htm
---
# Autodesk.Revit.DB.Analysis.MEPNetworkSegmentData.Dispose Method

Releases all resources used by the MEPNetworkSegmentData

## Syntax (C#)
```csharp
public void Dispose()
```